{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "first-3x3-conv-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "first-3x3-conv-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "first-3x3-conv-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "first-3x3-conv-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "first-3x3-conv-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "first-3x3-conv-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "first-3x3-conv-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "first-3x3-conv-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-0-block0-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-0-block0-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes0", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-0-block0-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-0-block0-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0], [23, 0, 1], [24, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-0-block0-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-0-block0-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-0-block0-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-0-block0-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block0-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block0-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 1], [39, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes2", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block0-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block0-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-1-block0-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block0-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block0-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block0-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block1-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block1-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape8", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes4", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape9", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block1-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block1-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-1-block1-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block1-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block1-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block1-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "seq-1-block1-shortcut", 
      "inputs": [[58, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block2-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block2-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape12", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes6", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape13", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block2-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block2-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-1-block2-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block2-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block2-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block2-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "seq-1-block2-shortcut", 
      "inputs": [[84, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block3-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block3-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 1], [116, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape16", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes8", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape17", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block3-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block3-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-1-block3-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-1-block3-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-1-block3-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-1-block3-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 1], [134, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "seq-1-block3-shortcut", 
      "inputs": [[110, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block0-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block0-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 1], [142, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape20", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes10", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape21", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block0-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block0-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0], [151, 0, 1], [152, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-2-block0-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block0-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block0-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block0-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0], [159, 0, 1], [160, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block1-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block1-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0], [165, 0, 0], [166, 0, 1], [167, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape24", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes12", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape25", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block1-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-depthwise-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-depthwise-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-depthwise-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block1-depthwise-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0], [176, 0, 1], [177, 0, 1]]
    }, 
    {
      "op": "clip", 
      "name": "seq-2-block1-depthwise-relu6", 
      "attr": {
        "a_max": "6", 
        "a_min": "0"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-linear-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block1-linear-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-linear-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-linear-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-linear-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block1-linear-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block1-linear-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 1], [185, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "seq-2-block1-shortcut", 
      "inputs": [[161, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-exp-conv2d_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block2-exp-conv2d", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "2", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-exp-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-exp-batchnorm_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-exp-batchnorm_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-exp-batchnorm_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "seq-2-block2-exp-batchnorm", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0], [191, 0, 0], [192, 0, 1], [193, 0, 1]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape28", 
      "attr": {"shape": "(0, -4, 2, -1, -2)"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "swapaxes14", 
      "attr": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape29", 
      "attr": {"shape": "(0, -3, -2)"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-depthwise-conv2d_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "seq-2-block2-depthwise-conv2d", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "seq-2-block2-depthwise-batchnorm_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
